garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.inc
// Register: TU16ACRT
#define TU16ACRT TU16ACRT
TU16ACRT                                 equ 0133h
// bitfield definitions
TU16ACRT_CRT_POSN                        equ 0000h
TU16ACRT_CRT_POSITION                    equ 0000h
TU16ACRT_CRT_SIZE                        equ 0008h
TU16ACRT_CRT_LENGTH                      equ 0008h
TU16ACRT_CRT_MASK                        equ 00FFh
TU16ACRT_CRT0_POSN                       equ 0000h
TU16ACRT_CRT0_POSITION                   equ 0000h
TU16ACRT_CRT0_SIZE                       equ 0001h
TU16ACRT_CRT0_LENGTH                     equ 0001h
TU16ACRT_CRT0_MASK                       equ 0001h
TU16ACRT_CRT1_POSN                       equ 0001h
TU16ACRT_CRT1_POSITION                   equ 0001h
TU16ACRT_CRT1_SIZE                       equ 0001h
TU16ACRT_CRT1_LENGTH                     equ 0001h
TU16ACRT_CRT1_MASK                       equ 0002h
TU16ACRT_CRT2_POSN                       equ 0002h
TU16ACRT_CRT2_POSITION                   equ 0002h
TU16ACRT_CRT2_SIZE                       equ 0001h
TU16ACRT_CRT2_LENGTH                     equ 0001h
TU16ACRT_CRT2_MASK                       equ 0004h
TU16ACRT_CRT3_POSN                       equ 0003h
TU16ACRT_CRT3_POSITION                   equ 0003h
TU16ACRT_CRT3_SIZE                       equ 0001h
TU16ACRT_CRT3_LENGTH                     equ 0001h
TU16ACRT_CRT3_MASK                       equ 0008h
TU16ACRT_CRT4_POSN                       equ 0004h
TU16ACRT_CRT4_POSITION                   equ 0004h
TU16ACRT_CRT4_SIZE                       equ 0001h
TU16ACRT_CRT4_LENGTH                     equ 0001h
TU16ACRT_CRT4_MASK                       equ 0010h
TU16ACRT_CRT5_POSN                       equ 0005h
TU16ACRT_CRT5_POSITION                   equ 0005h
TU16ACRT_CRT5_SIZE                       equ 0001h
TU16ACRT_CRT5_LENGTH                     equ 0001h
TU16ACRT_CRT5_MASK                       equ 0020h
TU16ACRT_CRT6_POSN                       equ 0006h
TU16ACRT_CRT6_POSITION                   equ 0006h
TU16ACRT_CRT6_SIZE                       equ 0001h
TU16ACRT_CRT6_LENGTH                     equ 0001h
TU16ACRT_CRT6_MASK                       equ 0040h
TU16ACRT_CRT7_POSN                       equ 0007h
TU16ACRT_CRT7_POSITION                   equ 0007h
TU16ACRT_CRT7_SIZE                       equ 0001h
TU16ACRT_CRT7_LENGTH                     equ 0001h
TU16ACRT_CRT7_MASK                       equ 0080h
TU16ACRT_TU16ACRT0_POSN                  equ 0000h
TU16ACRT_TU16ACRT0_POSITION              equ 0000h
TU16ACRT_TU16ACRT0_SIZE                  equ 0001h
TU16ACRT_TU16ACRT0_LENGTH                equ 0001h
TU16ACRT_TU16ACRT0_MASK                  equ 0001h
TU16ACRT_TU16ACRT1_POSN                  equ 0001h
TU16ACRT_TU16ACRT1_POSITION              equ 0001h
TU16ACRT_TU16ACRT1_SIZE                  equ 0001h
TU16ACRT_TU16ACRT1_LENGTH                equ 0001h
TU16ACRT_TU16ACRT1_MASK                  equ 0002h
TU16ACRT_TU16ACRT2_POSN                  equ 0002h
TU16ACRT_TU16ACRT2_POSITION              equ 0002h
TU16ACRT_TU16ACRT2_SIZE                  equ 0001h
TU16ACRT_TU16ACRT2_LENGTH                equ 0001h
TU16ACRT_TU16ACRT2_MASK                  equ 0004h
TU16ACRT_TU16ACRT3_POSN                  equ 0003h
TU16ACRT_TU16ACRT3_POSITION              equ 0003h
TU16ACRT_TU16ACRT3_SIZE                  equ 0001h
TU16ACRT_TU16ACRT3_LENGTH                equ 0001h
TU16ACRT_TU16ACRT3_MASK                  equ 0008h
TU16ACRT_TU16ACRT4_POSN                  equ 0004h
TU16ACRT_TU16ACRT4_POSITION              equ 0004h
TU16ACRT_TU16ACRT4_SIZE                  equ 0001h
TU16ACRT_TU16ACRT4_LENGTH                equ 0001h
TU16ACRT_TU16ACRT4_MASK                  equ 0010h
TU16ACRT_TU16ACRT5_POSN                  equ 0005h
TU16ACRT_TU16ACRT5_POSITION              equ 0005h
TU16ACRT_TU16ACRT5_SIZE                  equ 0001h
TU16ACRT_TU16ACRT5_LENGTH                equ 0001h
TU16ACRT_TU16ACRT5_MASK                  equ 0020h
TU16ACRT_TU16ACRT6_POSN                  equ 0006h
TU16ACRT_TU16ACRT6_POSITION              equ 0006h
TU16ACRT_TU16ACRT6_SIZE                  equ 0001h
TU16ACRT_TU16ACRT6_LENGTH                equ 0001h
TU16ACRT_TU16ACRT6_MASK                  equ 0040h
TU16ACRT_TU16ACRT7_POSN                  equ 0007h
TU16ACRT_TU16ACRT7_POSITION              equ 0007h
TU16ACRT_TU16ACRT7_SIZE                  equ 0001h
TU16ACRT_TU16ACRT7_LENGTH                equ 0001h
TU16ACRT_TU16ACRT7_MASK                  equ 0080h
TU16ACRT_TU16ACR24_POSN                  equ 0000h
TU16ACRT_TU16ACR24_POSITION              equ 0000h
TU16ACRT_TU16ACR24_SIZE                  equ 0001h
TU16ACRT_TU16ACR24_LENGTH                equ 0001h
TU16ACRT_TU16ACR24_MASK                  equ 0001h
TU16ACRT_TU16ACR25_POSN                  equ 0001h
TU16ACRT_TU16ACR25_POSITION              equ 0001h
TU16ACRT_TU16ACR25_SIZE                  equ 0001h
TU16ACRT_TU16ACR25_LENGTH                equ 0001h
TU16ACRT_TU16ACR25_MASK                  equ 0002h
TU16ACRT_TU16ACR26_POSN                  equ 0002h
TU16ACRT_TU16ACR26_POSITION              equ 0002h
TU16ACRT_TU16ACR26_SIZE                  equ 0001h
TU16ACRT_TU16ACR26_LENGTH                equ 0001h
TU16ACRT_TU16ACR26_MASK                  equ 0004h
TU16ACRT_TU16ACR27_POSN                  equ 0003h
TU16ACRT_TU16ACR27_POSITION              equ 0003h
TU16ACRT_TU16ACR27_SIZE                  equ 0001h
TU16ACRT_TU16ACR27_LENGTH                equ 0001h
TU16ACRT_TU16ACR27_MASK                  equ 0008h
TU16ACRT_TU16ACR28_POSN                  equ 0004h
TU16ACRT_TU16ACR28_POSITION              equ 0004h
TU16ACRT_TU16ACR28_SIZE                  equ 0001h
TU16ACRT_TU16ACR28_LENGTH                equ 0001h
TU16ACRT_TU16ACR28_MASK                  equ 0010h
TU16ACRT_TU16ACR29_POSN                  equ 0005h
TU16ACRT_TU16ACR29_POSITION              equ 0005h
TU16ACRT_TU16ACR29_SIZE                  equ 0001h
TU16ACRT_TU16ACR29_LENGTH                equ 0001h
TU16ACRT_TU16ACR29_MASK                  equ 0020h
TU16ACRT_TU16ACR30_POSN                  equ 0006h
TU16ACRT_TU16ACR30_POSITION              equ 0006h
TU16ACRT_TU16ACR30_SIZE                  equ 0001h
TU16ACRT_TU16ACR30_LENGTH                equ 0001h
TU16ACRT_TU16ACR30_MASK                  equ 0040h
TU16ACRT_TU16ACR31_POSN                  equ 0007h
TU16ACRT_TU16ACR31_POSITION              equ 0007h
TU16ACRT_TU16ACR31_SIZE                  equ 0001h
TU16ACRT_TU16ACR31_LENGTH                equ 0001h
TU16ACRT_TU16ACR31_MASK                  equ 0080h

// Register: TU16APR
#define TU16APR TU16APR
TU16APR                                  equ 0134h

// Register: TU16APRL
#define TU16APRL TU16APRL
TU16APRL                                 equ 0134h
// bitfield definitions
TU16APRL_PRL_POSN                        equ 0000h
TU16APRL_PRL_POSITION                    equ 0000h
TU16APRL_PRL_SIZE                        equ 0008h
TU16APRL_PRL_LENGTH                      equ 0008h
TU16APRL_PRL_MASK                        equ 00FFh
TU16APRL_PRL0_POSN                       equ 0000h
TU16APRL_PRL0_POSITION                   equ 0000h
TU16APRL_PRL0_SIZE                       equ 0001h
TU16APRL_PRL0_LENGTH                     equ 0001h
TU16APRL_PRL0_MASK                       equ 0001h
TU16APRL_PRL1_POSN                       equ 0001h
TU16APRL_PRL1_POSITION                   equ 0001h
TU16APRL_PRL1_SIZE                       equ 0001h
TU16APRL_PRL1_LENGTH                     equ 0001h
TU16APRL_PRL1_MASK                       equ 0002h
TU16APRL_PRL2_POSN                       equ 0002h
TU16APRL_PRL2_POSITION                   equ 0002h
TU16APRL_PRL2_SIZE                       equ 0001h
TU16APRL_PRL2_LENGTH                     equ 0001h
TU16APRL_PRL2_MASK                       equ 0004h
TU16APRL_PRL3_POSN                       equ 0003h
TU16APRL_PRL3_POSITION                   equ 0003h
TU16APRL_PRL3_SIZE                       equ 0001h
TU16APRL_PRL3_LENGTH                     equ 0001h
TU16APRL_PRL3_MASK                       equ 0008h
TU16APRL_PRL4_POSN                       equ 0004h
TU16APRL_PRL4_POSITION                   equ 0004h
TU16APRL_PRL4_SIZE                       equ 0001h
TU16APRL_PRL4_LENGTH                     equ 0001h
TU16APRL_PRL4_MASK                       equ 0010h
TU16APRL_PRL5_POSN                       equ 0005h
TU16APRL_PRL5_POSITION                   equ 0005h
TU16APRL_PRL5_SIZE                       equ 0001h
TU16APRL_PRL5_LENGTH                     equ 0001h
TU16APRL_PRL5_MASK                       equ 0020h
TU16APRL_PRL6_POSN                       equ 0006h
TU16APRL_PRL6_POSITION                   equ 0006h
TU16APRL_PRL6_SIZE                       equ 0001h
TU16APRL_PRL6_LENGTH                     equ 0001h
TU16APRL_PRL6_MASK                       equ 0040h
TU16APRL_PRL7_POSN                       equ 0007h
TU16APRL_PRL7_POSITION                   equ 0007h
TU16APRL_PRL7_SIZE                       equ 0001h
TU16APRL_PRL7_LENGTH                     equ 0001h
TU16APRL_PRL7_MASK                       equ 0080h
TU16APRL_TU16APRL0_POSN                  equ 0000h
TU16APRL_TU16APRL0_POSITION              equ 0000h
TU16APRL_TU16APRL0_SIZE                  equ 0001h
TU16APRL_TU16APRL0_LENGTH                equ 0001h
TU16APRL_TU16APRL0_MASK                  equ 0001h
TU16APRL_TU16APRL1_POSN                  equ 0001h
TU16APRL_TU16APRL1_POSITION              equ 0001h
TU16APRL_TU16APRL1_SIZE                  equ 0001h
TU16APRL_TU16APRL1_LENGTH                equ 0001h
TU16APRL_TU16APRL1_MASK                  equ 0002h
TU16APRL_TU16APRL2_POSN                  equ 0002h
TU16APRL_TU16APRL2_POSITION              equ 0002h
TU16APRL_TU16APRL2_SIZE                  equ 0001h
TU16APRL_TU16APRL2_LENGTH                equ 0001h
TU16APRL_TU16APRL2_MASK                  equ 0004h
TU16APRL_TU16APRL3_POSN                  equ 0003h
TU16APRL_TU16APRL3_POSITION              equ 0003h
TU16APRL_TU16APRL3_SIZE                  equ 0001h
TU16APRL_TU16APRL3_LENGTH                equ 0001h
TU16APRL_TU16APRL3_MASK                  equ 0008h
TU16APRL_TU16APRL4_POSN                  equ 0004h
TU16APRL_TU16APRL4_POSITION              equ 0004h
TU16APRL_TU16APRL4_SIZE                  equ 0001h
TU16APRL_TU16APRL4_LENGTH                equ 0001h
TU16APRL_TU16APRL4_MASK                  equ 0010h
TU16APRL_TU16APRL5_POSN                  equ 0005h
TU16APRL_TU16APRL5_POSITION              equ 0005h
TU16APRL_TU16APRL5_SIZE                  equ 0001h
TU16APRL_TU16APRL5_LENGTH                equ 0001h
TU16APRL_TU16APRL5_MASK                  equ 0020h
TU16APRL_TU16APRL6_POSN                  equ 0006h
TU16APRL_TU16APRL6_POSITION              equ 0006h
TU16APRL_TU16APRL6_SIZE                  equ 0001h
TU16APRL_TU16APRL6_LENGTH                equ 0001h
TU16APRL_TU16APRL6_MASK                  equ 0040h
TU16APRL_TU16APRL7_POSN                  equ 0007h
TU16APRL_TU16APRL7_POSITION              equ 0007h
TU16APRL_TU16APRL7_SIZE                  equ 0001h
TU16APRL_TU16APRL7_LENGTH                equ 0001h
TU16APRL_TU16APRL7_MASK                  equ 0080h
TU16APRL_TU16APR0_POSN                   equ 0000h
TU16APRL_TU16APR0_POSITION               equ 0000h
TU16APRL_TU16APR0_SIZE                   equ 0001h
TU16APRL_TU16APR0_LENGTH                 equ 0001h
TU16APRL_TU16APR0_MASK                   equ 0001h
TU16APRL_TU16APR1_POSN                   equ 0001h
TU16APRL_TU16APR1_POSITION               equ 0001h
TU16APRL_TU16APR1_SIZE                   equ 0001h
TU16APRL_TU16APR1_LENGTH                 equ 0001h
TU16APRL_TU16APR1_MASK                   equ 0002h
TU16APRL_TU16APR2_POSN                   equ 0002h
TU16APRL_TU16APR2_POSITION               equ 0002h
TU16APRL_TU16APR2_SIZE                   equ 0001h
TU16APRL_TU16APR2_LENGTH                 equ 0001h
TU16APRL_TU16APR2_MASK                   equ 0004h
TU16APRL_TU16APR3_POSN                   equ 0003h
TU16APRL_TU16APR3_POSITION               equ 0003h
TU16APRL_TU16APR3_SIZE                   equ 0001h
TU16APRL_TU16APR3_LENGTH                 equ 0001h
TU16APRL_TU16APR3_MASK                   equ 0008h
TU16APRL_TU16APR4_POSN                   equ 0004h
TU16APRL_TU16APR4_POSITION               equ 0004h
TU16APRL_TU16APR4_SIZE                   equ 0001h
TU16APRL_TU16APR4_LENGTH                 equ 0001h
TU16APRL_TU16APR4_MASK                   equ 0010h
TU16APRL_TU16APR5_POSN                   equ 0005h
TU16APRL_TU16APR5_POSITION               equ 0005h
TU16APRL_TU16APR5_SIZE                   equ 0001h
TU16APRL_TU16APR5_LENGTH                 equ 0001h
TU16APRL_TU16APR5_MASK                   equ 0020h
TU16APRL_TU16APR6_POSN                   equ 0006h
TU16APRL_TU16APR6_POSITION               equ 0006h
TU16APRL_TU16APR6_SIZE                   equ 0001h
TU16APRL_TU16APR6_LENGTH                 equ 0001h
TU16APRL_TU16APR6_MASK                   equ 0040h
TU16APRL_TU16APR7_POSN                   equ 0007h
TU16APRL_TU16APR7_POSITION               equ 0007h
TU16APRL_TU16APR7_SIZE                   equ 0001h
TU16APRL_TU16APR7_LENGTH                 equ 0001h
TU16APRL_TU16APR7_MASK                   equ 0080h

// Register: TU16APRH
#define TU16APRH TU16APRH
TU16APRH                                 equ 0135h
// bitfield definitions
TU16APRH_PRH_POSN                        equ 0000h
TU16APRH_PRH_POSITION                    equ 0000h
TU16APRH_PRH_SIZE                        equ 0008h
TU16APRH_PRH_LENGTH                      equ 0008h
TU16APRH_PRH_MASK                        equ 00FFh
TU16APRH_PRH0_POSN                       equ 0000h
TU16APRH_PRH0_POSITION                   equ 0000h
TU16APRH_PRH0_SIZE                       equ 0001h
TU16APRH_PRH0_LENGTH                     equ 0001h
TU16APRH_PRH0_MASK                       equ 0001h
TU16APRH_PRH1_POSN                       equ 0001h
TU16APRH_PRH1_POSITION                   equ 0001h
TU16APRH_PRH1_SIZE                       equ 0001h
TU16APRH_PRH1_LENGTH                     equ 0001h
TU16APRH_PRH1_MASK                       equ 0002h
TU16APRH_PRH2_POSN                       equ 0002h
TU16APRH_PRH2_POSITION                   equ 0002h
TU16APRH_PRH2_SIZE                       equ 0001h
TU16APRH_PRH2_LENGTH                     equ 0001h
TU16APRH_PRH2_MASK                       equ 0004h
TU16APRH_PRH3_POSN                       equ 0003h
TU16APRH_PRH3_POSITION                   equ 0003h
TU16APRH_PRH3_SIZE                       equ 0001h
TU16APRH_PRH3_LENGTH                     equ 0001h
TU16APRH_PRH3_MASK                       equ 0008h
TU16APRH_PRH4_POSN                       equ 0004h
TU16APRH_PRH4_POSITION                   equ 0004h
TU16APRH_PRH4_SIZE                       equ 0001h
TU16APRH_PRH4_LENGTH                     equ 0001h
TU16APRH_PRH4_MASK                       equ 0010h
TU16APRH_PRH5_POSN                       equ 0005h
TU16APRH_PRH5_POSITION                   equ 0005h
TU16APRH_PRH5_SIZE                       equ 0001h
TU16APRH_PRH5_LENGTH                     equ 0001h
TU16APRH_PRH5_MASK                       equ 0020h
TU16APRH_PRH6_POSN                       equ 0006h
TU16APRH_PRH6_POSITION                   equ 0006h
TU16APRH_PRH6_SIZE                       equ 0001h
TU16APRH_PRH6_LENGTH                     equ 0001h
TU16APRH_PRH6_MASK                       equ 0040h
TU16APRH_PRH7_POSN                       equ 0007h
TU16APRH_PRH7_POSITION                   equ 0007h
TU16APRH_PRH7_SIZE                       equ 0001h
TU16APRH_PRH7_LENGTH                     equ 0001h
TU16APRH_PRH7_MASK                       equ 0080h
TU16APRH_TU16APRH0_POSN                  equ 0000h
TU16APRH_TU16APRH0_POSITION              equ 0000h
TU16APRH_TU16APRH0_SIZE                  equ 0001h
TU16APRH_TU16APRH0_LENGTH                equ 0001h
TU16APRH_TU16APRH0_MASK                  equ 0001h
TU16APRH_TU16APRH1_POSN                  equ 0001h
TU16APRH_TU16APRH1_POSITION              equ 0001h
TU16APRH_TU16APRH1_SIZE                  equ 0001h
TU16APRH_TU16APRH1_LENGTH                equ 0001h
TU16APRH_TU16APRH1_MASK                  equ 0002h
TU16APRH_TU16APRH2_POSN                  equ 0002h
TU16APRH_TU16APRH2_POSITION              equ 0002h
TU16APRH_TU16APRH2_SIZE                  equ 0001h
TU16APRH_TU16APRH2_LENGTH                equ 0001h
TU16APRH_TU16APRH2_MASK                  equ 0004h
TU16APRH_TU16APRH3_POSN                  equ 0003h
TU16APRH_TU16APRH3_POSITION              equ 0003h
TU16APRH_TU16APRH3_SIZE                  equ 0001h
TU16APRH_TU16APRH3_LENGTH                equ 0001h
TU16APRH_TU16APRH3_MASK                  equ 0008h
TU16APRH_TU16APRH4_POSN                  equ 0004h
TU16APRH_TU16APRH4_POSITION              equ 0004h
TU16APRH_TU16APRH4_SIZE                  equ 0001h
TU16APRH_TU16APRH4_LENGTH                equ 0001h
TU16APRH_TU16APRH4_MASK                  equ 0010h
TU16APRH_TU16APRH5_POSN                  equ 0005h
TU16APRH_TU16APRH5_POSITION              equ 0005h
TU16APRH_TU16APRH5_SIZE                  equ 0001h
TU16APRH_TU16APRH5_LENGTH                equ 0001h
TU16APRH_TU16APRH5_MASK                  equ 0020h
TU16APRH_TU16APRH6_POSN                  equ 0006h
TU16APRH_TU16APRH6_POSITION              equ 0006h
TU16APRH_TU16APRH6_SIZE                  equ 0001h
TU16APRH_TU16APRH6_LENGTH                equ 0001h
TU16APRH_TU16APRH6_MASK                  equ 0040h
TU16APRH_TU16APRH7_POSN                  equ 0007h
TU16APRH_TU16APRH7_POSITION              equ 0007h
TU16APRH_TU16APRH7_SIZE                  equ 0001h
TU16APRH_TU16APRH7_LENGTH                equ 0001h
TU16APRH_TU16APRH7_MASK                  equ 0080h
TU16APRH_TU16APR8_POSN                   equ 0000h
TU16APRH_TU16APR8_POSITION               equ 0000h
TU16APRH_TU16APR8_SIZE                   equ 0001h
TU16APRH_TU16APR8_LENGTH                 equ 0001h
TU16APRH_TU16APR8_MASK                   equ 0001h
TU16APRH_TU16APR9_POSN                   equ 0001h
TU16APRH_TU16APR9_POSITION               equ 0001h
TU16APRH_TU16APR9_SIZE                   equ 0001h
TU16APRH_TU16APR9_LENGTH                 equ 0001h
TU16APRH_TU16APR9_MASK                   equ 0002h
TU16APRH_TU16APR10_POSN                  equ 0002h
TU16APRH_TU16APR10_POSITION              equ 0002h
TU16APRH_TU16APR10_SIZE                  equ 0001h
TU16APRH_TU16APR10_LENGTH                equ 0001h
TU16APRH_TU16APR10_MASK                  equ 0004h
TU16APRH_TU16APR11_POSN                  equ 0003h
TU16APRH_TU16APR11_POSITION              equ 0003h
TU16APRH_TU16APR11_SIZE                  equ 0001h
TU16APRH_TU16APR11_LENGTH                equ 0001h
TU16APRH_TU16APR11_MASK                  equ 0008h
TU16APRH_TU16APR12_POSN                  equ 0004h
TU16APRH_TU16APR12_POSITION              equ 0004h
TU16APRH_TU16APR12_SIZE                  equ 0001h
TU16APRH_TU16APR12_LENGTH                equ 0001h
TU16APRH_TU16APR12_MASK                  equ 0010h
TU16APRH_TU16APR13_POSN                  equ 0005h
TU16APRH_TU16APR13_POSITION              equ 0005h
TU16APRH_TU16APR13_SIZE                  equ 0001h
TU16APRH_TU16APR13_LENGTH                equ 0001h
TU16APRH_TU16APR13_MASK                  equ 0020h
TU16APRH_TU16APR14_POSN                  equ 0006h
TU16APRH_TU16APR14_POSITION              equ 0006h
TU16APRH_TU16APR14_SIZE                  equ 0001h
TU16APRH_TU16APR14_LENGTH                equ 0001h
TU16APRH_TU16APR14_MASK                  equ 0040h
TU16APRH_TU16APR15_POSN                  equ 0007h
TU16APRH_TU16APR15_POSITION              equ 0007h
TU16APRH_TU16APR15_SIZE                  equ 0001h
TU16APRH_TU16APR15_LENGTH                equ 0001h
TU16APRH_TU16APR15_MASK                  equ 0080h

