garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.inc
// Register: I2C1CON2
#define I2C1CON2 I2C1CON2
I2C1CON2                                 equ 01E8h
// bitfield definitions
I2C1CON2_BFRET_POSN                      equ 0000h
I2C1CON2_BFRET_POSITION                  equ 0000h
I2C1CON2_BFRET_SIZE                      equ 0002h
I2C1CON2_BFRET_LENGTH                    equ 0002h
I2C1CON2_BFRET_MASK                      equ 0003h
I2C1CON2_SDAHT_POSN                      equ 0002h
I2C1CON2_SDAHT_POSITION                  equ 0002h
I2C1CON2_SDAHT_SIZE                      equ 0002h
I2C1CON2_SDAHT_LENGTH                    equ 0002h
I2C1CON2_SDAHT_MASK                      equ 000Ch
I2C1CON2_ABD_POSN                        equ 0004h
I2C1CON2_ABD_POSITION                    equ 0004h
I2C1CON2_ABD_SIZE                        equ 0001h
I2C1CON2_ABD_LENGTH                      equ 0001h
I2C1CON2_ABD_MASK                        equ 0010h
I2C1CON2_GCEN_POSN                       equ 0006h
I2C1CON2_GCEN_POSITION                   equ 0006h
I2C1CON2_GCEN_SIZE                       equ 0001h
I2C1CON2_GCEN_LENGTH                     equ 0001h
I2C1CON2_GCEN_MASK                       equ 0040h
I2C1CON2_ACNT_POSN                       equ 0007h
I2C1CON2_ACNT_POSITION                   equ 0007h
I2C1CON2_ACNT_SIZE                       equ 0001h
I2C1CON2_ACNT_LENGTH                     equ 0001h
I2C1CON2_ACNT_MASK                       equ 0080h
I2C1CON2_BFRET0_POSN                     equ 0000h
I2C1CON2_BFRET0_POSITION                 equ 0000h
I2C1CON2_BFRET0_SIZE                     equ 0001h
I2C1CON2_BFRET0_LENGTH                   equ 0001h
I2C1CON2_BFRET0_MASK                     equ 0001h
I2C1CON2_BFRET1_POSN                     equ 0001h
I2C1CON2_BFRET1_POSITION                 equ 0001h
I2C1CON2_BFRET1_SIZE                     equ 0001h
I2C1CON2_BFRET1_LENGTH                   equ 0001h
I2C1CON2_BFRET1_MASK                     equ 0002h
I2C1CON2_SDAHT0_POSN                     equ 0002h
I2C1CON2_SDAHT0_POSITION                 equ 0002h
I2C1CON2_SDAHT0_SIZE                     equ 0001h
I2C1CON2_SDAHT0_LENGTH                   equ 0001h
I2C1CON2_SDAHT0_MASK                     equ 0004h
I2C1CON2_SDAHT1_POSN                     equ 0003h
I2C1CON2_SDAHT1_POSITION                 equ 0003h
I2C1CON2_SDAHT1_SIZE                     equ 0001h
I2C1CON2_SDAHT1_LENGTH                   equ 0001h
I2C1CON2_SDAHT1_MASK                     equ 0008h

// Register: I2C1CON3
#define I2C1CON3 I2C1CON3
I2C1CON3                                 equ 01E9h
// bitfield definitions
I2C1CON3_ACNTMD_POSN                     equ 0000h
I2C1CON3_ACNTMD_POSITION                 equ 0000h
I2C1CON3_ACNTMD_SIZE                     equ 0002h
I2C1CON3_ACNTMD_LENGTH                   equ 0002h
I2C1CON3_ACNTMD_MASK                     equ 0003h
I2C1CON3_FME_POSN                        equ 0002h
I2C1CON3_FME_POSITION                    equ 0002h
I2C1CON3_FME_SIZE                        equ 0002h
I2C1CON3_FME_LENGTH                      equ 0002h
I2C1CON3_FME_MASK                        equ 000Ch
I2C1CON3_BFREDR_POSN                     equ 0004h
I2C1CON3_BFREDR_POSITION                 equ 0004h
I2C1CON3_BFREDR_SIZE                     equ 0001h
I2C1CON3_BFREDR_LENGTH                   equ 0001h
I2C1CON3_BFREDR_MASK                     equ 0010h
I2C1CON3_ACNTMD0_POSN                    equ 0000h
I2C1CON3_ACNTMD0_POSITION                equ 0000h
I2C1CON3_ACNTMD0_SIZE                    equ 0001h
I2C1CON3_ACNTMD0_LENGTH                  equ 0001h
I2C1CON3_ACNTMD0_MASK                    equ 0001h
I2C1CON3_ACNTMD1_POSN                    equ 0001h
I2C1CON3_ACNTMD1_POSITION                equ 0001h
I2C1CON3_ACNTMD1_SIZE                    equ 0001h
I2C1CON3_ACNTMD1_LENGTH                  equ 0001h
I2C1CON3_ACNTMD1_MASK                    equ 0002h
I2C1CON3_FME0_POSN                       equ 0002h
I2C1CON3_FME0_POSITION                   equ 0002h
I2C1CON3_FME0_SIZE                       equ 0001h
I2C1CON3_FME0_LENGTH                     equ 0001h
I2C1CON3_FME0_MASK                       equ 0004h
I2C1CON3_FME1_POSN                       equ 0003h
I2C1CON3_FME1_POSITION                   equ 0003h
I2C1CON3_FME1_SIZE                       equ 0001h
I2C1CON3_FME1_LENGTH                     equ 0001h
I2C1CON3_FME1_MASK                       equ 0008h

// Register: I2C1PIR
#define I2C1PIR I2C1PIR
I2C1PIR                                  equ 01EAh
// bitfield definitions
I2C1PIR_SCIF_POSN                        equ 0000h
I2C1PIR_SCIF_POSITION                    equ 0000h
I2C1PIR_SCIF_SIZE                        equ 0001h
I2C1PIR_SCIF_LENGTH                      equ 0001h
I2C1PIR_SCIF_MASK                        equ 0001h
I2C1PIR_RSCIF_POSN                       equ 0001h
I2C1PIR_RSCIF_POSITION                   equ 0001h
I2C1PIR_RSCIF_SIZE                       equ 0001h
I2C1PIR_RSCIF_LENGTH                     equ 0001h
I2C1PIR_RSCIF_MASK                       equ 0002h
I2C1PIR_PCIF_POSN                        equ 0002h
I2C1PIR_PCIF_POSITION                    equ 0002h
I2C1PIR_PCIF_SIZE                        equ 0001h
I2C1PIR_PCIF_LENGTH                      equ 0001h
I2C1PIR_PCIF_MASK                        equ 0004h
I2C1PIR_ADRIF_POSN                       equ 0003h
I2C1PIR_ADRIF_POSITION                   equ 0003h
I2C1PIR_ADRIF_SIZE                       equ 0001h
I2C1PIR_ADRIF_LENGTH                     equ 0001h
I2C1PIR_ADRIF_MASK                       equ 0008h
I2C1PIR_WRIF_POSN                        equ 0004h
I2C1PIR_WRIF_POSITION                    equ 0004h
I2C1PIR_WRIF_SIZE                        equ 0001h
I2C1PIR_WRIF_LENGTH                      equ 0001h
I2C1PIR_WRIF_MASK                        equ 0010h
I2C1PIR_ACKTIF_POSN                      equ 0006h
I2C1PIR_ACKTIF_POSITION                  equ 0006h
I2C1PIR_ACKTIF_SIZE                      equ 0001h
I2C1PIR_ACKTIF_LENGTH                    equ 0001h
I2C1PIR_ACKTIF_MASK                      equ 0040h
I2C1PIR_CNTIF_POSN                       equ 0007h
I2C1PIR_CNTIF_POSITION                   equ 0007h
I2C1PIR_CNTIF_SIZE                       equ 0001h
I2C1PIR_CNTIF_LENGTH                     equ 0001h
I2C1PIR_CNTIF_MASK                       equ 0080h
I2C1PIR_SC1IF_POSN                       equ 0000h
I2C1PIR_SC1IF_POSITION                   equ 0000h
I2C1PIR_SC1IF_SIZE                       equ 0001h
I2C1PIR_SC1IF_LENGTH                     equ 0001h
I2C1PIR_SC1IF_MASK                       equ 0001h
I2C1PIR_RSC1IF_POSN                      equ 0001h
I2C1PIR_RSC1IF_POSITION                  equ 0001h
I2C1PIR_RSC1IF_SIZE                      equ 0001h
I2C1PIR_RSC1IF_LENGTH                    equ 0001h
I2C1PIR_RSC1IF_MASK                      equ 0002h
I2C1PIR_PC1IF_POSN                       equ 0002h
I2C1PIR_PC1IF_POSITION                   equ 0002h
I2C1PIR_PC1IF_SIZE                       equ 0001h
I2C1PIR_PC1IF_LENGTH                     equ 0001h
I2C1PIR_PC1IF_MASK                       equ 0004h
I2C1PIR_ADR1IF_POSN                      equ 0003h
I2C1PIR_ADR1IF_POSITION                  equ 0003h
I2C1PIR_ADR1IF_SIZE                      equ 0001h
I2C1PIR_ADR1IF_LENGTH                    equ 0001h
I2C1PIR_ADR1IF_MASK                      equ 0008h
I2C1PIR_WR1IF_POSN                       equ 0004h
I2C1PIR_WR1IF_POSITION                   equ 0004h
I2C1PIR_WR1IF_SIZE                       equ 0001h
I2C1PIR_WR1IF_LENGTH                     equ 0001h
I2C1PIR_WR1IF_MASK                       equ 0010h
I2C1PIR_ACKT1IF_POSN                     equ 0006h
I2C1PIR_ACKT1IF_POSITION                 equ 0006h
I2C1PIR_ACKT1IF_SIZE                     equ 0001h
I2C1PIR_ACKT1IF_LENGTH                   equ 0001h
I2C1PIR_ACKT1IF_MASK                     equ 0040h
I2C1PIR_CNT1IF_POSN                      equ 0007h
I2C1PIR_CNT1IF_POSITION                  equ 0007h
I2C1PIR_CNT1IF_SIZE                      equ 0001h
I2C1PIR_CNT1IF_LENGTH                    equ 0001h
I2C1PIR_CNT1IF_MASK                      equ 0080h

