garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.inc
// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 039Dh
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0005h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0005h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 001Fh
CLCIN0PPS_CLCIN0PPS0_POSN                equ 0000h
CLCIN0PPS_CLCIN0PPS0_POSITION            equ 0000h
CLCIN0PPS_CLCIN0PPS0_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS0_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS0_MASK                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSN                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSITION            equ 0001h
CLCIN0PPS_CLCIN0PPS1_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS1_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS1_MASK                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSN                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSITION            equ 0002h
CLCIN0PPS_CLCIN0PPS2_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS2_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS2_MASK                equ 0004h
CLCIN0PPS_CLCIN0PPS3_POSN                equ 0003h
CLCIN0PPS_CLCIN0PPS3_POSITION            equ 0003h
CLCIN0PPS_CLCIN0PPS3_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS3_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS3_MASK                equ 0008h
CLCIN0PPS_CLCIN0PPS4_POSN                equ 0004h
CLCIN0PPS_CLCIN0PPS4_POSITION            equ 0004h
CLCIN0PPS_CLCIN0PPS4_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS4_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS4_MASK                equ 0010h

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 039Eh
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0005h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0005h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 001Fh
CLCIN1PPS_CLCIN1PPS0_POSN                equ 0000h
CLCIN1PPS_CLCIN1PPS0_POSITION            equ 0000h
CLCIN1PPS_CLCIN1PPS0_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS0_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS0_MASK                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSN                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSITION            equ 0001h
CLCIN1PPS_CLCIN1PPS1_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS1_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS1_MASK                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSN                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSITION            equ 0002h
CLCIN1PPS_CLCIN1PPS2_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS2_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS2_MASK                equ 0004h
CLCIN1PPS_CLCIN1PPS3_POSN                equ 0003h
CLCIN1PPS_CLCIN1PPS3_POSITION            equ 0003h
CLCIN1PPS_CLCIN1PPS3_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS3_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS3_MASK                equ 0008h
CLCIN1PPS_CLCIN1PPS4_POSN                equ 0004h
CLCIN1PPS_CLCIN1PPS4_POSITION            equ 0004h
CLCIN1PPS_CLCIN1PPS4_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS4_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS4_MASK                equ 0010h

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 039Fh
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0005h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0005h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 001Fh
CLCIN2PPS_CLCIN2PPS0_POSN                equ 0000h
CLCIN2PPS_CLCIN2PPS0_POSITION            equ 0000h
CLCIN2PPS_CLCIN2PPS0_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS0_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS0_MASK                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSN                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSITION            equ 0001h
CLCIN2PPS_CLCIN2PPS1_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS1_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS1_MASK                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSN                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSITION            equ 0002h
CLCIN2PPS_CLCIN2PPS2_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS2_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS2_MASK                equ 0004h
CLCIN2PPS_CLCIN2PPS3_POSN                equ 0003h
CLCIN2PPS_CLCIN2PPS3_POSITION            equ 0003h
CLCIN2PPS_CLCIN2PPS3_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS3_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS3_MASK                equ 0008h
CLCIN2PPS_CLCIN2PPS4_POSN                equ 0004h
CLCIN2PPS_CLCIN2PPS4_POSITION            equ 0004h
CLCIN2PPS_CLCIN2PPS4_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS4_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS4_MASK                equ 0010h

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 03A0h
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0005h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0005h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 001Fh
CLCIN3PPS_CLCIN3PPS0_POSN                equ 0000h
CLCIN3PPS_CLCIN3PPS0_POSITION            equ 0000h
CLCIN3PPS_CLCIN3PPS0_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS0_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS0_MASK                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSN                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSITION            equ 0001h
CLCIN3PPS_CLCIN3PPS1_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS1_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS1_MASK                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSN                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSITION            equ 0002h
CLCIN3PPS_CLCIN3PPS2_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS2_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS2_MASK                equ 0004h
CLCIN3PPS_CLCIN3PPS3_POSN                equ 0003h
CLCIN3PPS_CLCIN3PPS3_POSITION            equ 0003h
CLCIN3PPS_CLCIN3PPS3_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS3_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS3_MASK                equ 0008h
CLCIN3PPS_CLCIN3PPS4_POSN                equ 0004h
CLCIN3PPS_CLCIN3PPS4_POSITION            equ 0004h
CLCIN3PPS_CLCIN3PPS4_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS4_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS4_MASK                equ 0010h

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
U1CTSPPS                                 equ 03A1h
// bitfield definitions
U1CTSPPS_U1CTSPPS_POSN                   equ 0000h
U1CTSPPS_U1CTSPPS_POSITION               equ 0000h
U1CTSPPS_U1CTSPPS_SIZE                   equ 0005h
U1CTSPPS_U1CTSPPS_LENGTH                 equ 0005h
U1CTSPPS_U1CTSPPS_MASK                   equ 001Fh
U1CTSPPS_U1CTSPPS0_POSN                  equ 0000h
U1CTSPPS_U1CTSPPS0_POSITION              equ 0000h
U1CTSPPS_U1CTSPPS0_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS0_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS0_MASK                  equ 0001h
U1CTSPPS_U1CTSPPS1_POSN                  equ 0001h
U1CTSPPS_U1CTSPPS1_POSITION              equ 0001h
U1CTSPPS_U1CTSPPS1_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS1_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS1_MASK                  equ 0002h
U1CTSPPS_U1CTSPPS2_POSN                  equ 0002h
U1CTSPPS_U1CTSPPS2_POSITION              equ 0002h
U1CTSPPS_U1CTSPPS2_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS2_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS2_MASK                  equ 0004h
U1CTSPPS_U1CTSPPS3_POSN                  equ 0003h
U1CTSPPS_U1CTSPPS3_POSITION              equ 0003h
U1CTSPPS_U1CTSPPS3_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS3_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS3_MASK                  equ 0008h
U1CTSPPS_U1CTSPPS4_POSN                  equ 0004h
U1CTSPPS_U1CTSPPS4_POSITION              equ 0004h
U1CTSPPS_U1CTSPPS4_SIZE                  equ 0001h
U1CTSPPS_U1CTSPPS4_LENGTH                equ 0001h
U1CTSPPS_U1CTSPPS4_MASK                  equ 0010h

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
U1RXPPS                                  equ 03A2h
// bitfield definitions
U1RXPPS_U1RXPPS_POSN                     equ 0000h
U1RXPPS_U1RXPPS_POSITION                 equ 0000h
U1RXPPS_U1RXPPS_SIZE                     equ 0005h
U1RXPPS_U1RXPPS_LENGTH                   equ 0005h
U1RXPPS_U1RXPPS_MASK                     equ 001Fh
U1RXPPS_U1RXPPS0_POSN                    equ 0000h
U1RXPPS_U1RXPPS0_POSITION                equ 0000h
U1RXPPS_U1RXPPS0_SIZE                    equ 0001h
U1RXPPS_U1RXPPS0_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS0_MASK                    equ 0001h
U1RXPPS_U1RXPPS1_POSN                    equ 0001h
U1RXPPS_U1RXPPS1_POSITION                equ 0001h
U1RXPPS_U1RXPPS1_SIZE                    equ 0001h
U1RXPPS_U1RXPPS1_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS1_MASK                    equ 0002h
U1RXPPS_U1RXPPS2_POSN                    equ 0002h
U1RXPPS_U1RXPPS2_POSITION                equ 0002h
U1RXPPS_U1RXPPS2_SIZE                    equ 0001h
U1RXPPS_U1RXPPS2_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS2_MASK                    equ 0004h
U1RXPPS_U1RXPPS3_POSN                    equ 0003h
U1RXPPS_U1RXPPS3_POSITION                equ 0003h
U1RXPPS_U1RXPPS3_SIZE                    equ 0001h
U1RXPPS_U1RXPPS3_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS3_MASK                    equ 0008h
U1RXPPS_U1RXPPS4_POSN                    equ 0004h
U1RXPPS_U1RXPPS4_POSITION                equ 0004h
U1RXPPS_U1RXPPS4_SIZE                    equ 0001h
U1RXPPS_U1RXPPS4_LENGTH                  equ 0001h
U1RXPPS_U1RXPPS4_MASK                    equ 0010h

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
U2CTSPPS                                 equ 03A3h
// bitfield definitions
U2CTSPPS_U2CTSPPS_POSN                   equ 0000h
U2CTSPPS_U2CTSPPS_POSITION               equ 0000h
U2CTSPPS_U2CTSPPS_SIZE                   equ 0005h
U2CTSPPS_U2CTSPPS_LENGTH                 equ 0005h
U2CTSPPS_U2CTSPPS_MASK                   equ 001Fh
U2CTSPPS_U2CTSPPS0_POSN                  equ 0000h
U2CTSPPS_U2CTSPPS0_POSITION              equ 0000h
U2CTSPPS_U2CTSPPS0_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS0_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS0_MASK                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSN                  equ 0001h
U2CTSPPS_U2CTSPPS1_POSITION              equ 0001h
U2CTSPPS_U2CTSPPS1_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS1_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS1_MASK                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSN                  equ 0002h
U2CTSPPS_U2CTSPPS2_POSITION              equ 0002h
U2CTSPPS_U2CTSPPS2_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS2_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS2_MASK                  equ 0004h
U2CTSPPS_U2CTSPPS3_POSN                  equ 0003h
U2CTSPPS_U2CTSPPS3_POSITION              equ 0003h
U2CTSPPS_U2CTSPPS3_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS3_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS3_MASK                  equ 0008h
U2CTSPPS_U2CTSPPS4_POSN                  equ 0004h
U2CTSPPS_U2CTSPPS4_POSITION              equ 0004h
U2CTSPPS_U2CTSPPS4_SIZE                  equ 0001h
U2CTSPPS_U2CTSPPS4_LENGTH                equ 0001h
U2CTSPPS_U2CTSPPS4_MASK                  equ 0010h

