garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f06q20.inc
#define BCR1                             BANKMASK(I3C1BCR), 1, b
#define BCR2                             BANKMASK(I3C1BCR), 2, b
#define BCR3                             BANKMASK(I3C1BCR), 3, b
#define BCR4                             BANKMASK(I3C1BCR), 4, b
#define BCR5                             BANKMASK(I3C1BCR), 5, b
#define BCR6                             BANKMASK(I3C1BCR), 6, b
#define BCR7                             BANKMASK(I3C1BCR), 7, b
#define BERRDET                          BANKMASK(I3C1CON1), 3, b
#define BFRE                             BANKMASK(I2C1STAT0), 7, b
#define BFREDR                           BANKMASK(I2C1CON3), 4, b
#define BFREE                            BANKMASK(I3C1STAT0), 7, b
#define BFRET0                           BANKMASK(I2C1CON2), 0, b
#define BFRET1                           BANKMASK(I2C1CON2), 1, b
#define BMODE                            BANKMASK(SPI1CON0), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BTFIE                            BANKMASK(I3C1PIE0), 1, b
#define BTFIF                            BANKMASK(I3C1PIR0), 1, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTOC0                            BANKMASK(I2C1BTOC), 0, b
#define BTOC1                            BANKMASK(I2C1BTOC), 1, b
#define BTOC2                            BANKMASK(I2C1BTOC), 2, b
#define BTOEN                            BANKMASK(I3C1CON0), 6, b
#define BUF0                             BANKMASK(DMAnBUF), 0, b
#define BUF1                             BANKMASK(DMAnBUF), 1, b
#define BUF2                             BANKMASK(DMAnBUF), 2, b
#define BUF3                             BANKMASK(DMAnBUF), 3, b
#define BUF4                             BANKMASK(DMAnBUF), 4, b
#define BUF5                             BANKMASK(DMAnBUF), 5, b
#define BUF6                             BANKMASK(DMAnBUF), 6, b
#define BUF7                             BANKMASK(DMAnBUF), 7, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define BUSEIE                           BANKMASK(I3C1ERRIE0), 2, b
#define BUSEIF                           BANKMASK(I3C1ERRIR0), 2, b
#define C0EN                             BANKMASK(U1CON2), 3, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2TSEL2                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL3                          BANKMASK(CCPTMRS0), 3, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, b
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, b
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, b
#define CCP1EN                           BANKMASK(CCP1CON), 7, b
#define CCP1FMT                          BANKMASK(CCP1CON), 4, b
#define CCP1IE                           BANKMASK(PIE4), 4, a
#define CCP1IF                           BANKMASK(PIR4), 4, a
#define CCP1IP                           BANKMASK(IPR4), 4, a
#define CCP1MD                           BANKMASK(PMD2), 2, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, b
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, b
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, b
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, b
#define CCP1OUT                          BANKMASK(CCP1CON), 5, b
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, b
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, b
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, b
#define CCP2EN                           BANKMASK(CCP2CON), 7, b
#define CCP2FMT                          BANKMASK(CCP2CON), 4, b
#define CCP2IE                           BANKMASK(PIE4), 5, a
#define CCP2IF                           BANKMASK(PIR4), 5, a
#define CCP2IP                           BANKMASK(IPR4), 5, a
#define CCP2MD                           BANKMASK(PMD2), 3, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, b
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, b
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, b
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, b
#define CCP2OUT                          BANKMASK(CCP2CON), 5, b
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CERIE                            BANKMASK(U1ERRIE), 4, b
#define CERIF                            BANKMASK(U1ERRIR), 4, b
#define CGA0                             BANKMASK(ADCG1A), 0, b
#define CGA1                             BANKMASK(ADCG1A), 1, b
#define CGA2                             BANKMASK(ADCG1A), 2, b
#define CGA4                             BANKMASK(ADCG1A), 4, b
#define CGA5                             BANKMASK(ADCG1A), 5, b
#define CGC0                             BANKMASK(ADCG1C), 0, b
#define CGC1                             BANKMASK(ADCG1C), 1, b
#define CGC3                             BANKMASK(ADCG1C), 3, b
#define CGC4                             BANKMASK(ADCG1C), 4, b
#define CGC5                             BANKMASK(ADCG1C), 5, b
#define CGC6                             BANKMASK(ADCG1C), 6, b
#define CGC7                             BANKMASK(ADCG1C), 7, b
#define CH16AB                           BANKMASK(TUCHAIN), 0, b
#define CKE                              BANKMASK(SPI1CON1), 6, b
#define CKP                              BANKMASK(SPI1CON1), 5, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CLC1IE                           BANKMASK(PIE5), 3, a
#define CLC1IF                           BANKMASK(PIR5), 3, a
#define CLC1IP                           BANKMASK(IPR5), 3, a
#define CLC1MD                           BANKMASK(PMD2), 7, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE5), 4, a
#define CLC2IF                           BANKMASK(PIR5), 4, a
#define CLC2IP                           BANKMASK(IPR5), 4, a
#define CLC2MD                           BANKMASK(PMD3), 0, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE5), 5, a
#define CLC3IF                           BANKMASK(PIR5), 5, a
#define CLC3IP                           BANKMASK(IPR5), 5, a
#define CLC3MD                           BANKMASK(PMD3), 1, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE5), 6, a
#define CLC4IF                           BANKMASK(PIR5), 6, a
#define CLC4IP                           BANKMASK(IPR5), 6, a
#define CLC4MD                           BANKMASK(PMD3), 2, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLKEN                            BANKMASK(PORTWCON), 0, a
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD1), 3, b
#define CLKSEL0                          BANKMASK(SPI1CLK), 0, b
#define CLKSEL1                          BANKMASK(SPI1CLK), 1, b
#define CLKSEL2                          BANKMASK(SPI1CLK), 2, b
#define CLKSEL3                          BANKMASK(SPI1CLK), 3, b
#define CLRRXB                           BANKMASK(I3C1CON0), 3, b
#define CLRTXB                           BANKMASK(I3C1CON0), 4, b
#define CNT10                            BANKMASK(I2C1CNTH), 2, b
#define CNT11                            BANKMASK(I2C1CNTH), 3, b
#define CNT12                            BANKMASK(I2C1CNTH), 4, b
#define CNT13                            BANKMASK(I2C1CNTH), 5, b
#define CNT14                            BANKMASK(I2C1CNTH), 6, b
#define CNT15                            BANKMASK(I2C1CNTH), 7, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT8                             BANKMASK(I2C1CNTH), 0, b
#define CNT9                             BANKMASK(I2C1CNTH), 1, b
#define CNTIE                            BANKMASK(I2C1PIE), 7, b
#define CNTIF                            BANKMASK(I2C1PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE2), 5, a
#define CRCIF                            BANKMASK(PIR2), 5, a
#define CRCIP                            BANKMASK(IPR2), 5, a
#define CRCMD                            BANKMASK(PMD0), 5, b
#define CREN                             BANKMASK(I3C1EC), 1, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS4                              BANKMASK(ADCLK), 4, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSD                              BANKMASK(I2C1CON1), 0, b
#define CSTR                             BANKMASK(I2C1CON0), 4, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE3), 0, a
#define CSWIF                            BANKMASK(PIR3), 0, a
#define CSWIP                            BANKMASK(IPR3), 0, a
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE5), 2, a
#define CWG1IF                           BANKMASK(PIR5), 2, a
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1IP                           BANKMASK(IPR5), 2, a
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1LSDB0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSDB1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD2), 6, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define DACHIE                           BANKMASK(I3C1PIE1), 6, b
#define DACHIF                           BANKMASK(I3C1PIR1), 6, b
#define DADRIE                           BANKMASK(I3C1PIE0), 2, b
#define DADRIF                           BANKMASK(I3C1PIR0), 2, b
#define DATA                             BANKMASK(I2C1STAT0), 3, b
#define DATA0                            BANKMASK(CRCDATAL), 0, b
#define DATA1                            BANKMASK(CRCDATAL), 1, b
#define DATA10                           BANKMASK(CRCDATAH), 2, b
#define DATA11                           BANKMASK(CRCDATAH), 3, b
#define DATA12                           BANKMASK(CRCDATAH), 4, b
#define DATA13                           BANKMASK(CRCDATAH), 5, b
#define DATA14                           BANKMASK(CRCDATAH), 6, b
#define DATA15                           BANKMASK(CRCDATAH), 7, b
#define DATA16                           BANKMASK(CRCDATAU), 0, b
#define DATA17                           BANKMASK(CRCDATAU), 1, b
#define DATA18                           BANKMASK(CRCDATAU), 2, b
#define DATA19                           BANKMASK(CRCDATAU), 3, b
#define DATA2                            BANKMASK(CRCDATAL), 2, b
#define DATA20                           BANKMASK(CRCDATAU), 4, b
#define DATA21                           BANKMASK(CRCDATAU), 5, b
#define DATA22                           BANKMASK(CRCDATAU), 6, b
#define DATA23                           BANKMASK(CRCDATAU), 7, b
#define DATA24                           BANKMASK(CRCDATAT), 0, b
#define DATA25                           BANKMASK(CRCDATAT), 1, b
#define DATA26                           BANKMASK(CRCDATAT), 2, b
#define DATA27                           BANKMASK(CRCDATAT), 3, b
#define DATA28                           BANKMASK(CRCDATAT), 4, b
#define DATA29                           BANKMASK(CRCDATAT), 5, b
#define DATA3                            BANKMASK(CRCDATAL), 3, b
#define DATA30                           BANKMASK(CRCDATAT), 6, b
#define DATA31                           BANKMASK(CRCDATAT), 7, b
#define DATA4                            BANKMASK(CRCDATAL), 4, b
#define DATA5                            BANKMASK(CRCDATAL), 5, b
#define DATA6                            BANKMASK(CRCDATAL), 6, b
#define DATA7                            BANKMASK(CRCDATAL), 7, b
#define DATA8                            BANKMASK(CRCDATAH), 0, b
#define DATA9                            BANKMASK(CRCDATAH), 1, b
#define DBF0                             BANKMASK(CWG1DBF), 0, b
#define DBF1                             BANKMASK(CWG1DBF), 1, b
#define DBF2                             BANKMASK(CWG1DBF), 2, b
#define DBF3                             BANKMASK(CWG1DBF), 3, b
#define DBF4                             BANKMASK(CWG1DBF), 4, b
#define DBF5                             BANKMASK(CWG1DBF), 5, b
#define DBR0                             BANKMASK(CWG1DBR), 0, b
#define DBR1                             BANKMASK(CWG1DBR), 1, b
#define DBR2                             BANKMASK(CWG1DBR), 2, b
#define DBR3                             BANKMASK(CWG1DBR), 3, b
#define DBR4                             BANKMASK(CWG1DBR), 4, b
#define DBR5                             BANKMASK(CWG1DBR), 5, b
#define DC0                              BANKMASK(CLKRCON), 3, b
#define DC1                              BANKMASK(CLKRCON), 4, b
#define DCNT0                            BANKMASK(DMAnDCNTL), 0, b
#define DCNT1                            BANKMASK(DMAnDCNTL), 1, b
#define DCNT10                           BANKMASK(DMAnDCNTH), 2, b
#define DCNT11                           BANKMASK(DMAnDCNTH), 3, b
#define DCNT2                            BANKMASK(DMAnDCNTL), 2, b
#define DCNT3                            BANKMASK(DMAnDCNTL), 3, b
#define DCNT4                            BANKMASK(DMAnDCNTL), 4, b
#define DCNT5                            BANKMASK(DMAnDCNTL), 5, b
#define DCNT6                            BANKMASK(DMAnDCNTL), 6, b
#define DCNT7                            BANKMASK(DMAnDCNTL), 7, b
#define DCNT8                            BANKMASK(DMAnDCNTH), 0, b
#define DCNT9                            BANKMASK(DMAnDCNTH), 1, b
#define DF0                              BANKMASK(PORTWDF), 0, a
#define DF1                              BANKMASK(PORTWDF), 1, a
#define DF2                              BANKMASK(PORTWDF), 2, a
#define DF3                              BANKMASK(PORTWDF), 3, a
#define DF4                              BANKMASK(PORTWDF), 4, a
#define DF5                              BANKMASK(PORTWDF), 5, a
#define DF6                              BANKMASK(PORTWDF), 6, a
#define DF7                              BANKMASK(PORTWDF), 7, a
#define DGO                              BANKMASK(DMAnCON0), 5, b
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON2), 0, b
#define DLEN1                            BANKMASK(CRCCON2), 1, b
#define DLEN2                            BANKMASK(CRCCON2), 2, b
#define DLEN3                            BANKMASK(CRCCON2), 3, b
#define DLEN4                            BANKMASK(CRCCON2), 4, b
#define DMA1AIE                          BANKMASK(PIE0), 7, a
#define DMA1AIF                          BANKMASK(PIR0), 7, a
#define DMA1AIP                          BANKMASK(IPR0), 7, a
#define DMA1DCNTIE                       BANKMASK(PIE0), 5, a
#define DMA1DCNTIF                       BANKMASK(PIR0), 5, a
#define DMA1DCNTIP                       BANKMASK(IPR0), 5, a
#define DMA1MD                           BANKMASK(PMD0), 0, b
#define DMA1ORIE                         BANKMASK(PIE0), 6, a
#define DMA1ORIF                         BANKMASK(PIR0), 6, a
#define DMA1ORIP                         BANKMASK(IPR0), 6, a
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNTIE                       BANKMASK(PIE0), 4, a
#define DMA1SCNTIF                       BANKMASK(PIR0), 4, a
#define DMA1SCNTIP                       BANKMASK(IPR0), 4, a
#define DMA2AIE                          BANKMASK(PIE1), 3, a
#define DMA2AIF                          BANKMASK(PIR1), 3, a
